In [4]:
import pandas as pd

In [7]:
df_exam = pd.read_excel('./data/excel_exam.xlsx')
df_exam.head()

   id  nclass  math  english  science
0   1       1    50       98       50
1   2       1    60       97       60
2   3       1    45       86       78
3   4       1    30       98       58
4   5       2    25       80       65

In [15]:
sum(df_exam['math'])/len(df_exam)

57.45

In [16]:
sum(df_exam['english'])/len(df_exam)

84.9

# 첫 번째 행이 변수가 아니라면?
- read_excel() 함수에 header = None 입력하기

In [18]:
df_exam_novar = pd.read_excel('./data/excel_exam_novar.xlsx')
df_exam_novar.head()

   1  1.1  50  98  50.1
0  2    1  60  97    60
1  3    2  25  80    65
2  4    2  50  89    98
3  5    3  20  98    15
4  6    3  50  98    45

In [19]:
df_exam_novar = pd.read_excel('./data/excel_exam_novar.xlsx', header = None)
df_exam_novar.head()

   0  1   2   3   4
0  1  1  50  98  50
1  2  1  60  97  60
2  3  2  25  80  65
3  4  2  50  89  98
4  5  3  20  98  15